[Survived] ArrowFunction
ducks/ApplicationDucks/ModalTodoCreate/index.ts:17:37
 }
 
 /* Action Creators */
-export const closeModalTodoCreate = () : ICloseModalTodoCreate => ({
-  type: CLOSE_MODAL_TODO_CREATE
-})
+export const closeModalTodoCreate = () => undefined
 
 export const openModalTodoCreate = () : IOpenModalTodoCreate => ({

[Survived] ArrowFunction
ducks/ApplicationDucks/ModalTodoCreate/index.ts:21:36
   type: CLOSE_MODAL_TODO_CREATE
 })
 
-export const openModalTodoCreate = () : IOpenModalTodoCreate => ({
-  type: OPEN_MODAL_TODO_CREATE
-})
+export const openModalTodoCreate = () => undefined
 
 /* Action Handlers */

[Survived] ArrowFunction
ducks/ApplicationDucks/ModalTodoCreate/index.ts:26:39
 })
 
 /* Action Handlers */
-export const onCloseModalTodoCreate = (state: IApplicationState): IApplicationState => ({
-  ...state,
-  modals: {
-    ...state.modals,
-    todoCreate: {
-      ...state.modals.todoCreate,
-      open: false
-    }
-  }
-})
+export const onCloseModalTodoCreate = () => undefined
 
 export const onOpenModalTodoCreate = (state: IApplicationState): IApplicationState => ({

[Survived] BooleanLiteral
ducks/ApplicationDucks/ModalTodoCreate/index.ts:32:13
     ...state.modals,
     todoCreate: {
       ...state.modals.todoCreate,
-      open: false
+      open: true
     }
   }

[Survived] ArrowFunction
ducks/ApplicationDucks/ModalTodoCreate/index.ts:37:38
   }
 })
 
-export const onOpenModalTodoCreate = (state: IApplicationState): IApplicationState => ({
-  ...state,
-  modals: {
-    ...state.modals,
-    todoCreate: {
-      ...state.modals.todoCreate,
-      open: true,
-      alreadyOpened: true
-    }
-  }
-})
+export const onOpenModalTodoCreate = () => undefined
 
 export default {

[Survived] ObjectLiteral
ducks/ApplicationDucks/ModalTodoCreate/index.ts:37:88
   }
 })
 
-export const onOpenModalTodoCreate = (state: IApplicationState): IApplicationState => ({
-  ...state,
-  modals: {
-    ...state.modals,
-    todoCreate: {
-      ...state.modals.todoCreate,
-      open: true,
-      alreadyOpened: true
-    }
-  }
-})
+export const onOpenModalTodoCreate = (state: IApplicationState): IApplicationState => ({})
 
 export default {

[Survived] ObjectLiteral
ducks/ApplicationDucks/ModalTodoCreate/index.ts:41:17
   ...state,
   modals: {
     ...state.modals,
-    todoCreate: {
-      ...state.modals.todoCreate,
-      open: true,
-      alreadyOpened: true
-    }
+    todoCreate: {}
   }
 })

[Survived] BooleanLiteral
ducks/ApplicationDucks/ModalTodoCreate/index.ts:43:13
     ...state.modals,
     todoCreate: {
       ...state.modals.todoCreate,
-      open: true,
+      open: false,
       alreadyOpened: true
     }

[Survived] BooleanLiteral
ducks/ApplicationDucks/ModalTodoCreate/index.ts:44:22
     todoCreate: {
       ...state.modals.todoCreate,
       open: true,
-      alreadyOpened: true
+      alreadyOpened: false
     }
   }
