[Survived] ObjectLiteral
src/ducks/ApplicationDucks/index.ts:12:42
   }
 }
 
-const INITIAL_STATE: IApplicationState = {
-  modals: {
-    todoCreate: {
-      open: false,
-      alreadyOpened: false
-    }
-  }
-}
+const INITIAL_STATE: IApplicationState = {}
 
 const ACTION_HANDLERS = {

[Survived] BooleanLiteral
src/ducks/ApplicationDucks/index.ts:15:13
 const INITIAL_STATE: IApplicationState = {
   modals: {
     todoCreate: {
-      open: false,
+      open: true,
       alreadyOpened: false
     }

[Survived] BooleanLiteral
src/ducks/ApplicationDucks/index.ts:16:22
   modals: {
     todoCreate: {
       open: false,
-      alreadyOpened: false
+      alreadyOpened: true
     }
   }

[Survived] ArrayDeclaration
src/ducks/ApplicationDucks/index.ts:25:16
   ...modalTodoCreateActionHandlers
 }
 
-export default [INITIAL_STATE, ACTION_HANDLERS]
+export default []
 
