[Killed] StringLiteral
ducks/TodosDucks/AddTodo/index.ts:5:30
 import Todo from 'classes/Todo';
 
 /* Action Types */
-export const CALL_ADD_TODO = '@todo/CALL_ADD';
+export const CALL_ADD_TODO = "";
 export const ADD_TODO_FAILED = '@todo/ADD_FAILED';
 export const ADD_TODO_SUCCESS = '@todo/ADD_SUCCESS';

[Killed] ArrowFunction
ducks/TodosDucks/AddTodo/index.ts:27:24
 }
 
 /* Action Creators */
-export const addTodo = (title: string, description: string) : ICallAddTodo => ({
-  type: CALL_ADD_TODO,
-  title,
-  description
-})
+export const addTodo = () => undefined
 
 export const addTodoFailed = (error: string) : IAddTodoFailed => ({

[Killed] ArrowFunction
ducks/TodosDucks/AddTodo/index.ts:33:30
   description
 })
 
-export const addTodoFailed = (error: string) : IAddTodoFailed => ({
-  type: ADD_TODO_FAILED,
-  error
-})
+export const addTodoFailed = () => undefined
 
 export const addTodoSuccess = (todo: Todo) : IAddTodoSuccess => ({

[Killed] ObjectLiteral
ducks/TodosDucks/AddTodo/index.ts:33:67
   description
 })
 
-export const addTodoFailed = (error: string) : IAddTodoFailed => ({
-  type: ADD_TODO_FAILED,
-  error
-})
+export const addTodoFailed = (error: string) : IAddTodoFailed => ({})
 
 export const addTodoSuccess = (todo: Todo) : IAddTodoSuccess => ({

[Killed] ArrowFunction
ducks/TodosDucks/AddTodo/index.ts:38:31
   error
 })
 
-export const addTodoSuccess = (todo: Todo) : IAddTodoSuccess => ({
-  type: ADD_TODO_SUCCESS,
-  todo
-})
+export const addTodoSuccess = () => undefined
 
 /* Action Handlers */

[Killed] ArrowFunction
ducks/TodosDucks/AddTodo/index.ts:44:30
 })
 
 /* Action Handlers */
-export const onCallAddTodo = (state: ITodosState): ITodosState => ({
-  ...state,
-  loading: {
-    ...state.loading,
-    addTodo: true
-  }
-})
+export const onCallAddTodo = () => undefined
 
 export const onAddTodoFailed = (state: ITodosState): ITodosState => ({

[Killed] BooleanLiteral
ducks/TodosDucks/AddTodo/index.ts:48:14
   ...state,
   loading: {
     ...state.loading,
-    addTodo: true
+    addTodo: false
   }
 })

[Killed] ArrowFunction
ducks/TodosDucks/AddTodo/index.ts:52:32
   }
 })
 
-export const onAddTodoFailed = (state: ITodosState): ITodosState => ({
-  ...state,
-  loading: {
-    ...state.loading,
-    addTodo: false
-  }
-})
+export const onAddTodoFailed = () => undefined
 
 export const onAddTodoSuccess = (state: ITodosState, { todo }: IAddTodoSuccess): ITodosState => ({

[Killed] ObjectLiteral
ducks/TodosDucks/AddTodo/index.ts:52:70
   }
 })
 
-export const onAddTodoFailed = (state: ITodosState): ITodosState => ({
-  ...state,
-  loading: {
-    ...state.loading,
-    addTodo: false
-  }
-})
+export const onAddTodoFailed = (state: ITodosState): ITodosState => ({})
 
 export const onAddTodoSuccess = (state: ITodosState, { todo }: IAddTodoSuccess): ITodosState => ({

[Killed] ObjectLiteral
ducks/TodosDucks/AddTodo/index.ts:54:12
 
 export const onAddTodoFailed = (state: ITodosState): ITodosState => ({
   ...state,
-  loading: {
-    ...state.loading,
-    addTodo: false
-  }
+  loading: {}
 })
 

[Killed] BooleanLiteral
ducks/TodosDucks/AddTodo/index.ts:56:14
   ...state,
   loading: {
     ...state.loading,
-    addTodo: false
+    addTodo: true
   }
 })

[Killed] ArrowFunction
ducks/TodosDucks/AddTodo/index.ts:60:33
   }
 })
 
-export const onAddTodoSuccess = (state: ITodosState, { todo }: IAddTodoSuccess): ITodosState => ({
-  ...state,
-  data: [ ...state.data, todo ],
-  loading: {
-    ...state.loading,
-    addTodo: false
-  }
-})
+export const onAddTodoSuccess = () => undefined
 
 export default {

[Killed] ArrayDeclaration
ducks/TodosDucks/AddTodo/index.ts:62:9
 
 export const onAddTodoSuccess = (state: ITodosState, { todo }: IAddTodoSuccess): ITodosState => ({
   ...state,
-  data: [ ...state.data, todo ],
+  data: [],
   loading: {
     ...state.loading,

[Killed] ObjectLiteral
ducks/TodosDucks/AddTodo/index.ts:63:12
 export const onAddTodoSuccess = (state: ITodosState, { todo }: IAddTodoSuccess): ITodosState => ({
   ...state,
   data: [ ...state.data, todo ],
-  loading: {
-    ...state.loading,
-    addTodo: false
-  }
+  loading: {}
 })
 

[Killed] ObjectLiteral
ducks/TodosDucks/AddTodo/index.ts:69:16
   }
 })
 
-export default {
-  [CALL_ADD_TODO]: onCallAddTodo,
-  [ADD_TODO_FAILED]: onAddTodoFailed,
-  [ADD_TODO_SUCCESS]: onAddTodoSuccess
-}
+export default {}
 
