[Survived] StringLiteral
ducks/TodosDucks/RemoveTodo/index.ts:6:36
 /* Action Types */
 export const CALL_REMOVE_TODO = '@todo/CALL_REMOVE';
 export const REMOVE_TODO_FAILED = '@todo/REMOVE_FAILED';
-export const REMOVE_TODO_SUCCESS = '@todo/REMOVE_SUCCESS';
+export const REMOVE_TODO_SUCCESS = "";
 
 /* Action Interfaces */

[Survived] ArrowFunction
ducks/TodosDucks/RemoveTodo/index.ts:26:27
 }
 
 /* Action Creators */
-export const removeTodo = (todoId: string) : ICallRemoveTodo => ({
-  type: CALL_REMOVE_TODO,
-  todoId
-})
+export const removeTodo = () => undefined
 
 export const removeTodoFailed = (todoId: string, error: string) : IRemoveTodoFailed => ({

[Survived] ArrowFunction
ducks/TodosDucks/RemoveTodo/index.ts:31:33
   todoId
 })
 
-export const removeTodoFailed = (todoId: string, error: string) : IRemoveTodoFailed => ({
-  type: REMOVE_TODO_FAILED,
-  todoId,
-  error
-})
+export const removeTodoFailed = () => undefined
 
 export const removeTodoSuccess = (todoId: string) : IRemoveTodoSuccess => ({

[Survived] ArrowFunction
ducks/TodosDucks/RemoveTodo/index.ts:37:34
   error
 })
 
-export const removeTodoSuccess = (todoId: string) : IRemoveTodoSuccess => ({
-  type: REMOVE_TODO_SUCCESS,
-  todoId
-})
+export const removeTodoSuccess = () => undefined
 
 /* Action Handlers */

[Survived] ObjectLiteral
ducks/TodosDucks/RemoveTodo/index.ts:37:76
   error
 })
 
-export const removeTodoSuccess = (todoId: string) : IRemoveTodoSuccess => ({
-  type: REMOVE_TODO_SUCCESS,
-  todoId
-})
+export const removeTodoSuccess = (todoId: string) : IRemoveTodoSuccess => ({})
 
 /* Action Handlers */

[Survived] ArrowFunction
ducks/TodosDucks/RemoveTodo/index.ts:43:33
 })
 
 /* Action Handlers */
-export const onCallRemoveTodo = (state: ITodosState, { todoId }: ICallRemoveTodo): ITodosState => ({
-  ...state,
-  loading: {
-    ...state.loading,
-    removeTodo: [
-      ...state.loading.removeTodo,
-      todoId
-    ]
-  }
-})
+export const onCallRemoveTodo = () => undefined
 
 export const onRemoveTodoFailed = (state: ITodosState, { todoId }: IRemoveTodoFailed): ITodosState => ({

[Survived] ArrowFunction
ducks/TodosDucks/RemoveTodo/index.ts:54:35
   }
 })
 
-export const onRemoveTodoFailed = (state: ITodosState, { todoId }: IRemoveTodoFailed): ITodosState => ({
-  ...state,
-  loading: {
-    ...state.loading,
-    removeTodo: state.loading.removeTodo.filter(id => id !== todoId)
-  }
-})
+export const onRemoveTodoFailed = () => undefined
 
 export const onRemoveTodoSuccess = (state: ITodosState, { todoId }: IRemoveTodoSuccess): ITodosState => ({

[Survived] ObjectLiteral
ducks/TodosDucks/RemoveTodo/index.ts:56:12
 
 export const onRemoveTodoFailed = (state: ITodosState, { todoId }: IRemoveTodoFailed): ITodosState => ({
   ...state,
-  loading: {
-    ...state.loading,
-    removeTodo: state.loading.removeTodo.filter(id => id !== todoId)
-  }
+  loading: {}
 })
 

[Survived] ArrowFunction
ducks/TodosDucks/RemoveTodo/index.ts:58:49
   ...state,
   loading: {
     ...state.loading,
-    removeTodo: state.loading.removeTodo.filter(id => id !== todoId)
+    removeTodo: state.loading.removeTodo.filter(() => undefined)
   }
 })

[Survived] EqualityOperator
ducks/TodosDucks/RemoveTodo/index.ts:58:55
   ...state,
   loading: {
     ...state.loading,
-    removeTodo: state.loading.removeTodo.filter(id => id !== todoId)
+    removeTodo: state.loading.removeTodo.filter(id => id === todoId)
   }
 })

[Survived] ArrowFunction
ducks/TodosDucks/RemoveTodo/index.ts:62:36
   }
 })
 
-export const onRemoveTodoSuccess = (state: ITodosState, { todoId }: IRemoveTodoSuccess): ITodosState => ({
-  ...state,
-  data: state.data.filter(todo => todo.id !== todoId),
-  loading: {
-    ...state.loading,
-    removeTodo: state.loading.removeTodo.filter(id => id !== todoId)
-  }
-})
+export const onRemoveTodoSuccess = () => undefined
 
 export default {

[Survived] EqualityOperator
ducks/TodosDucks/RemoveTodo/index.ts:64:35
 
 export const onRemoveTodoSuccess = (state: ITodosState, { todoId }: IRemoveTodoSuccess): ITodosState => ({
   ...state,
-  data: state.data.filter(todo => todo.id !== todoId),
+  data: state.data.filter(todo => todo.id === todoId),
   loading: {
     ...state.loading,

[Survived] ConditionalExpression
ducks/TodosDucks/RemoveTodo/index.ts:64:35
 
 export const onRemoveTodoSuccess = (state: ITodosState, { todoId }: IRemoveTodoSuccess): ITodosState => ({
   ...state,
-  data: state.data.filter(todo => todo.id !== todoId),
+  data: state.data.filter(todo => true),
   loading: {
     ...state.loading,

[Survived] ConditionalExpression
ducks/TodosDucks/RemoveTodo/index.ts:67:55
   data: state.data.filter(todo => todo.id !== todoId),
   loading: {
     ...state.loading,
-    removeTodo: state.loading.removeTodo.filter(id => id !== todoId)
+    removeTodo: state.loading.removeTodo.filter(id => true)
   }
 })
