[Survived] StringLiteral
src/ducks/TodosDucks/index.ts:16:54
 
 const INITIAL_STATE: ITodosState = {
   data: [
-    new Todo('3d04b772-e887-4f20-a273-74ce5fbaf2e6', 'Criar base do projeto', 'Utilizar o Create React App'),
+    new Todo('3d04b772-e887-4f20-a273-74ce5fbaf2e6', "", 'Utilizar o Create React App'),
     new Todo('2ef6b1c7-f472-4036-a3b5-992444261104', 'Criar estrutura do estado', 'Utilizar Redux'),
     new Todo('1c2b7538-b5a4-4aff-80ee-cef248ca3007', 'Criar controle de side effects', 'Utilizar Saga')

[Survived] StringLiteral
src/ducks/TodosDucks/index.ts:17:54
 const INITIAL_STATE: ITodosState = {
   data: [
     new Todo('3d04b772-e887-4f20-a273-74ce5fbaf2e6', 'Criar base do projeto', 'Utilizar o Create React App'),
-    new Todo('2ef6b1c7-f472-4036-a3b5-992444261104', 'Criar estrutura do estado', 'Utilizar Redux'),
+    new Todo('2ef6b1c7-f472-4036-a3b5-992444261104', "", 'Utilizar Redux'),
     new Todo('1c2b7538-b5a4-4aff-80ee-cef248ca3007', 'Criar controle de side effects', 'Utilizar Saga')
   ],

[Survived] BooleanLiteral
src/ducks/TodosDucks/index.ts:21:14
     new Todo('1c2b7538-b5a4-4aff-80ee-cef248ca3007', 'Criar controle de side effects', 'Utilizar Saga')
   ],
   loading: {
-    addTodo: false,
+    addTodo: true,
     removeTodo: []
   }

[Survived] ArrayDeclaration
src/ducks/TodosDucks/index.ts:22:17
   ],
   loading: {
     addTodo: false,
-    removeTodo: []
+    removeTodo: ["Stryker was here"]
   }
 }
