[Survived] ArrowFunction
react-redux-saga-typescript-todo/src/ducks/index.ts:12:23
   todos: ITodosState
 }
 
-const createReducer = ([initialState, actionHandlers]: any) => (
-  state = initialState,
-  action: any
-) =>
-  (actionHandlers[action.type] && actionHandlers[action.type](state, action)) ||
-  state;
+const createReducer = () => undefined;
 
 const createRootReducer = () =>

[Survived] ArrowFunction
react-redux-saga-typescript-todo/src/ducks/index.ts:12:64
   todos: ITodosState
 }
 
-const createReducer = ([initialState, actionHandlers]: any) => (
-  state = initialState,
-  action: any
-) =>
-  (actionHandlers[action.type] && actionHandlers[action.type](state, action)) ||
-  state;
+const createReducer = ([initialState, actionHandlers]: any) => () => undefined;
 
 const createRootReducer = () =>

[Survived] LogicalOperator
react-redux-saga-typescript-todo/src/ducks/index.ts:16:3
   state = initialState,
   action: any
 ) =>
-  (actionHandlers[action.type] && actionHandlers[action.type](state, action)) ||
-  state;
+  actionHandlers[action.type] && actionHandlers[action.type](state, action) && state;
 
 const createRootReducer = () =>

[Survived] ConditionalExpression
react-redux-saga-typescript-todo/src/ducks/index.ts:16:3
   state = initialState,
   action: any
 ) =>
-  (actionHandlers[action.type] && actionHandlers[action.type](state, action)) ||
-  state;
+  true;
 
 const createRootReducer = () =>

[Survived] ArrowFunction
react-redux-saga-typescript-todo/src/ducks/index.ts:19:27
   (actionHandlers[action.type] && actionHandlers[action.type](state, action)) ||
   state;
 
-const createRootReducer = () =>
-  combineReducers({
-    application: createReducer(ApplicationDucks),
-    todos: createReducer(TodosDucks)
-  });
+const createRootReducer = () => undefined;
 
 export default createRootReducer;
