[Survived] BlockStatement
sagas/TodosSagas/RemoveTodo/index.ts:9:51
 } from 'ducks/TodosDucks/RemoveTodo';
 import TodosAPI from 'integrations/TodosAPI';
 
-function* removeTodo({ todoId }: ICallRemoveTodo) {
-  try {
-    yield call(TodosAPI.removeTodo, todoId)
-    yield put(removeTodoSuccess(todoId))
-    message.success('Todo removed successfully!')
-  }
-  catch (error) {
-    yield put(removeTodoFailed(todoId, error))
-    message.error('The todo could not be removed!')
-  }
-}
+function* removeTodo({ todoId }: ICallRemoveTodo) {}
 
 function* removeTodoSagas() {

[Survived] BlockStatement
sagas/TodosSagas/RemoveTodo/index.ts:10:7
 import TodosAPI from 'integrations/TodosAPI';
 
 function* removeTodo({ todoId }: ICallRemoveTodo) {
-  try {
-    yield call(TodosAPI.removeTodo, todoId)
-    yield put(removeTodoSuccess(todoId))
-    message.success('Todo removed successfully!')
-  }
+  try {}
   catch (error) {
     yield put(removeTodoFailed(todoId, error))

[Survived] StringLiteral
sagas/TodosSagas/RemoveTodo/index.ts:13:21
   try {
     yield call(TodosAPI.removeTodo, todoId)
     yield put(removeTodoSuccess(todoId))
-    message.success('Todo removed successfully!')
+    message.success("")
   }
   catch (error) {

[Survived] BlockStatement
sagas/TodosSagas/RemoveTodo/index.ts:15:17
     yield put(removeTodoSuccess(todoId))
     message.success('Todo removed successfully!')
   }
-  catch (error) {
-    yield put(removeTodoFailed(todoId, error))
-    message.error('The todo could not be removed!')
-  }
+  catch (error) {}
 }
 

[Survived] BlockStatement
sagas/TodosSagas/RemoveTodo/index.ts:21:29
   }
 }
 
-function* removeTodoSagas() {
-  yield takeEvery(CALL_REMOVE_TODO, removeTodo)
-}
+function* removeTodoSagas() {}
 
 export default function* () {

[Survived] BlockStatement
sagas/TodosSagas/RemoveTodo/index.ts:25:29
   yield takeEvery(CALL_REMOVE_TODO, removeTodo)
 }
 
-export default function* () {
-  yield all([
-    fork(removeTodoSagas)
-  ])
-}
+export default function* () {}
 
