[Survived] BlockStatement
src/sagas/TodosSagas/index.ts:5:29
 import addTodoSagas from './AddTodo';
 import removeTodoSagas from './RemoveTodo';
 
-export default function* () {
-  yield all([
-    fork(addTodoSagas),
-    fork(removeTodoSagas)
-  ])
-}
+export default function* () {}
 
