[Survived] BlockStatement
react-redux-saga-typescript-todo/src/sagas/index.ts:4:28
 import { all, fork } from 'redux-saga/effects';
 import TodosSagas from './TodosSagas';
 
-export default function*() {
-  yield all([
-    fork(TodosSagas)
-  ]);
-}
+export default function*() {}
 

[Survived] ArrayDeclaration
react-redux-saga-typescript-todo/src/sagas/index.ts:5:13
 import TodosSagas from './TodosSagas';
 
 export default function*() {
-  yield all([
-    fork(TodosSagas)
-  ]);
+  yield all([]);
 }
 
